* Literatur
** Latex
*** Latex/KOMA Ref-Sheet
 - [[file:literature/prog/LaTeX_RefSheet.pdf][Refsheet]]
*** KOMA Docs
 - [[file:literature/prog/scrguide.pdf][KOMA Docs]]
*** AUCTeX
 - [[file:literature/prog/tex-ref.pdf][Auctex]]
*** Modular Documents
 - [[https://en.wikibooks.org/wiki/LaTeX/Modular_Documents][Modular Documents]]

** Feynman Rules
*** Siegert Vorlesung
    :LOGBOOK:
    CLOCK: [2020-03-18 Wed 10:57]--[2020-03-18 Wed 11:20] =>  0:23
    :END:
 - [[file:literature/feynman/tk-vorlesung.pdf][Vorlesung]]
 - [[file:literature/feynman/tk-vorlesung.pdf::54][Kapitel 4.3]]
   - Feynman Diags etc...
 - [[file:literature/feynman/tk-vorlesung.pdf::64][Kapitel 4.4]]
   - Beispiel zur Berechnung

** Particle Physics
*** Thomson
    :LOGBOOK:
    CLOCK: [2020-03-18 Wed 16:32]--[2020-03-18 Wed 21:01] =>  4:29
    CLOCK: [2020-03-18 Wed 11:20]--[2020-03-18 Wed 14:21] =>  3:01
    :END:
 - [[file:literature/feynman/Thomson.pdf][Modern Particle Physics]]
 - [[file:literature/feynman/Thomson.pdf::100][Spinors]]
 - [[file:literature/feynman/Thomson.pdf::107][Spinors, Helicity Eigenstates]]
 - [[file:literature/feynman/Thomson.pdf::533][Completeness Pol. Vectors]]
** Rivet
 - [[https://gitlab.com/hepcedar/rivet/tree/master/doc/tutorials][getting started]]
 - [[https://gitlab.com/hepcedar/rivet/tree/master/doc/tutorials][sherpa and rivet tutorial]]
** Monte Carlo
 - [[file:literature/mc/general_purp_evt.pdf::170][Allgemeines zu MC integration, sampling]]
 - [[file:literature/mc/vegas.pdf][VEGAS]]
 - [[file:literature/mc/vegas_algo.pdf][VEGAS Algorithm]]
** PDFs
 - [[file:literature/pdf/lhapdf6.pdf][LHAPDF6]]
** Pseudo Rapidity
 - https://physics.stackexchange.com/questions/12258/why-is-pseudorapidity-defined-as-log-tan-theta-2
** Sherpa
 -
* Aufgaben
** Erste Aufgabenp
   :LOGBOOK:
   CLOCK: [2020-03-20 Fri 09:30]
   :END:
*** Mail von Siegert
     :LOGBOOK:
     CLOCK: [2020-03-19 Thu 15:21]--[2020-03-19 Thu 17:25] =>  2:04
     CLOCK: [2020-03-19 Thu 10:05]--[2020-03-19 Thu 11:56] =>  1:51
     :END:
Hi Valentin,

alles klar. Das Formular machen wir dann einfach im Nachhinein und
datieren es zurueck.

Dann wuerde ich zur Einarbeitung vorschlagen, Du schaust Dir mal
meinen Aufschrieb zu Feynman-Regeln und der |M|^2-Berechnung aus der
Vorlesung an, Kapitel 4.3 und 4.4 hier:

  http://fsiegert.web.cern.ch/fsiegert/tmp/tk-vorlesung.pdf

Versuch das erstmal fuer den gezeigten Prozess nachzuvollziehen, und
schau dann, ob Du folgende Uebungsaufgaben aus meinem Kurs kannst: 4.1
4.2 5.1 5.2 5.3
https://bildungsportal.sachsen.de/opal/auth/RepositoryEntry/11966152704/CourseNode/92162447560998

Wenn Du konzeptionell oder rechnerisch irgendwo haengen bleibst, reden
wir (Skype/Vidyo/Zoom/...), damit ich einzelnes nochmal naeher
erlaeutern kann. Wenn Du damit durch bist, kann ich Dir die
Musterloesungen zur Verfuegung stellen und du schaust nochmal genauer,
ob noch irgendwas unklar ist.

Dann kannst Du mal qq->yy rechnen.

Klingt das OK fuer den Start?

Viele Gruesse, Frank
** Berechnung qq -> γγ
 - 4 Anlaeufe :). Idiotischerweise 4-Vektor negiert
 - letzter Anlauf mit Casimir Trick erfolgreich
 - gute tricks:
   - γ auf z Achse
   - Symmetrien Beachten -> spart die Haelfte beim umdrehen der Spins
 - Vollstaendigkeitsrelation von pol. Vektoren in Form: [[file:literature/feynman/Thomson.pdf::533][Completeness Pol. Vectors]]
** Vergleich mit Sherpa
 - [[file:prog/runcards/qqgg/Sherpa.yaml][Runcard]]
 - [[file:prog/python/qqgg/analytical_xs.ipynb][Notebook mit Implementierung der XS]]
 - Zeigte fehler in Rechnung auf

** Monte Carlo Methods
 - implementation as [[file:prog/python/qqgg/monte_carlo.py][module]]
 - [[file:prog/python/qqgg/analytical_xs.org::*Numerical Integration][Integration]]
 - [[file:prog/python/qqgg/analytical_xs.org::*Sampling and Analysis][Sampling and Analysis]]
*** DONE Check Statistics
 - 100 mal.... 67, check with random seed
 - error bars in histtype
*** DONE Variablen Trafo geschickt waehlen.
 - stratified sampling, vegas
**** TODO Something fishy about that variance estimate in vegas!!!
 - overesimate even stronger if evaluation point number increased
*** DONE Sherpa + Rivet
 - analyse + histogramme
 - Analysis: ~MC_DIPHOTON~, [[https://rivet.hepforge.org/analyses/MC_DIPHOTON.html][analysis reference]]
 - sherpa configure: ~../configure --enable-rivet=/usr/bin/rivet --prefix=/usr --enable-hepmc2=/usr~
 - manual
** Parton Density functions
 - [[https://lhapdf.hepforge.org/][pdf library]]
** Phaeono
*** pT sortieren
*** TODO Shower
 - pT only works with showers
 - remnants of proton create showers -> without fragmentation: no hadrons
 - can create more photons
 - limited -> conserves m_yy
   - Other recoil scheme [[https://sherpa-team.gitlab.io/sherpa/master/manual/parameters/parton-showers.html#cs-shower-options][CSS_KIN_SCHEME=0]] could fix that
*** TODO Fragmentation,
 - https://sherpa-team.gitlab.io/sherpa/master/manual/parameters/hadronization.html?highlight=fragmentation#id18
 - showers recombinate to hadrons
 - more photons
*** TODO MI
 - multiple partons interact, create showers etc


* Clock Table
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2020-03-18 Wed 21:01]
| Headline             | Time   |      |
|----------------------+--------+------|
| *Total time*         | *7:53* |      |
|----------------------+--------+------|
| Literatur            | 7:53   |      |
| \_  Feynman Rules    |        | 0:23 |
| \_  Particle Physics |        | 7:30 |
#+END:

* Fragen
** Lorentz Invar. Matrixelement
 - Ich stand ganz schoen auf dem Schlauch: Lorentz Invar = selbe Form
   in allen BS (muss nicht unb. konst bei LT sein), lorentzskalarfeld

** Impulserhaltung aus dem Gefuehl... (ohne deltas) ok?
** Normierung Photonenfeld?
** Globaler Spin bei pol. Vektoren?
** Spin nicht erhalten?
** Abweichungen im vergeich weiter diskutieren?
** Flavours im Proton
** Sind quark verhaeltnisse in PDF enthalten (2:1 fuer proton)
** beide finalstate photonen behalten?
** PDF members
** Sensitivity detectors cite! -> separation from beam
** was fuer eine pdf ist das NNPDF31lo
** four mom. conservation errors
** Warum Veto nur fuer MUONS
 - ich habe auch photons gevetoed
** Initial und finals state radiation?
** MPI
   - nur QCD -> wichtigste prozesse modelliert
   - The Jimmy model stops here, considering only hard events, and so
     it can only be applied to underlying event.
     - doesn't the mpi contain soft inclusive physics
** Jet algos
 - what are jet xs? -> particles jets as legs
 - why ist double counting a problem -> in exact calculation -> same diagramm
 - IS radiation: all partons?
** Soft Inclusive
 - wtf are those processes
** what does inclusive mean
** TODO
* Work Log
** 18.03
 - habe mich in manche konzeptionelle Dinge ziemlich verrannt!

* Todo
** TODO lab xs kuerzen
** coulomb singularity
 - immediate particle on shell
** nur shower
** TODO shower scale anpassen
** TODO effekt shower und kperp
